NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
/*******************************************************************************
* Defines internal data types and statements
*******************************************************************************/
#define PARAM_TYPE_OFFSET       (30u)
#define PARAM_TYPE_MASK         (3Lu << PARAM_TYPE_OFFSET)
#define PARAM_RWBIT_OFFSET      (29u)
#define PARAM_RWBIT_MASK        (1Lu << PARAM_RWBIT_OFFSET)
#define PARAM_FBIT_OFFSET       (28u)
#define PARAM_FBIT_MASK         (1Lu << PARAM_FBIT_OFFSET)
#define PARAM_UBIT_OFFSET       (23u)
#define PARAM_UBIT_MASK         (1Lu << PARAM_UBIT_OFFSET)
#define PARAM_WDID_OFFSET       (16u)
#define PARAM_WDID_MASK         (0x7FLu << PARAM_WDID_OFFSET)
#define PARAM_CRC_OFFSET        (24u)
#define PARAM_CRC_MASK          (0x0FLu << PARAM_CRC_OFFSET)

/* Defines align masks for uint16 and uint32 */
#define UINT16_ALIGN_MASK       (1Lu)
#define UINT32_ALIGN_MASK       (3Lu)

/* Defines supported parameter types */
#define DS_PARAM_TYPE_UINT8     (0x01u)
#define DS_PARAM_TYPE_UINT16    (0x02u)
#define DS_PARAM_TYPE_UINT32    (0x03u)


/* Defines PARAM_ID structure */
typedef struct
{
    uint16 offset;      /* parameter offset */
    uint8  widgetId;    /* widget Id parameter belongs to */
    uint8  affectsCrc;  /* parameter affects widget CRC */
    uint8  crc;         /* parameter CRC */
    uint8  flash;       /* parameter located in FLASH flag */
    uint8  rw;          /* parameter is read/write flag */
    uint8  type;        /* parameter type: uint8/uint16/uint32 */
} PARAM_ID_STRUCT;


/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/



static cy_status DsParseParamId(uint32 paramId, PARAM_ID_STRUCT *pData);

/** \}
* \endcond */


/*******************************************************************************
* Function Name: CapSense_1_DsInitialize
****************************************************************************//**
*
* \brief
*   This function initializes the Data Structure storage.
*
* \details
*   This function copies the default widget configuration parameters
*   from the Flash storage into the RAM Data Structure.
*
*******************************************************************************/
void CapSense_1_DsInitialize(void)
{
    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) || \
         (CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) || \
        ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)))
        uint32 snsId;
        uint32 wdgtId;
        CapSense_1_RAM_SNS_STRUCT * ptrSnsTmp;
        CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt;
    #endif

    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES))
        uint16 subConvNumber;
    #endif

    #if (0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)
        uint8 const * ptrIdacInit = CapSense_1_ramIdacInit;
    #endif

    /* Reset RAM data structure content */
    (void)memset(&CapSense_1_dsRam, 0, sizeof(CapSense_1_dsRam));

    /* Initialize configId, deviceId and hwClock registers */
    CapSense_1_dsRam.configId = CapSense_1_CONFIG_ID;
    CapSense_1_dsRam.deviceId = CapSense_1_DEVICE_ID;
    CapSense_1_dsRam.hwClock = CapSense_1_HW_CLOCK;

    /* Initialize global RAM data */
    CapSense_1_dsRam.csd0Config = CapSense_1_CSD0_CONFIG;

    #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
        CapSense_1_dsRam.modCsdClk = CapSense_1_CSD_SCANSPEED_DIVIDER;

        #if (0u != CapSense_1_CSD_COMMON_SNS_CLK_EN)
            CapSense_1_dsRam.snsCsdClk = CapSense_1_CSD_SNS_CLK_DIVIDER;
        #endif /* #if (0u != CapSense_1_CSD_COMMON_SNS_CLK_EN) */
    #endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) */

    #if (0u != CapSense_1_CSX_EN)
        CapSense_1_dsRam.modCsxClk = CapSense_1_CSX_SCANSPEED_DIVIDER;

        #if (0u != CapSense_1_CSX_COMMON_TX_CLK_EN)
            CapSense_1_dsRam.snsCsxClk = CapSense_1_CSX_TX_CLK_DIVIDER;
        #endif /* #if (0u != CapSense_1_CSX_COMMON_TX_CLK_EN) */
    #endif /* #if (0u != CapSense_1_CSX_EN) */

    #if (0u != CapSense_1_SELF_TEST_EN)
        CapSense_1_dsRam.glbCrc = CapSense_1_GLB_CRC;
    #endif /* #if (0u != CapSense_1_SELF_TEST_EN) */

    /* Initialize RAM widget data */
    CapSense_1_dsRam.wdgtList = CapSense_1_ramWidgetInit;

    /* Initialize Gesture configuration structure */
    #if ((0u != CapSense_1_GES_GLOBAL_EN) || (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN))
        CapSense_1_dsRam.timestampInterval = CapSense_1_TIMESTAMP_INTERVAL;
    #endif /* ((0u != CapSense_1_GES_GLOBAL_EN) || (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)) */

    #if (0u != CapSense_1_GES_GLOBAL_EN)
        CapSense_1_dsRam.gestures = CapSense_1_ramGesturesInit;
    #endif /* (0u != CapSense_1_GES_GLOBAL_EN) */

    #if (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)
        CapSense_1_dsRam.ballisticConfig = CapSense_1_ramBallisticInit;
    #endif /* (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN) */

    #if (0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)
        /* Initialize IDAC data */
        ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;

        for (wdgtId = CapSense_1_TOTAL_WIDGETS; wdgtId-- > 0u; )
        {
            ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;

            for (snsId = CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWdgt); snsId-- > 0u;)
            {
                ptrSnsTmp->idacComp[0u] = *ptrIdacInit;
                ptrIdacInit++;

                #if (0u != CapSense_1_MULTI_FREQ_SCAN_EN)
                    ptrSnsTmp->idacComp[1u] = *ptrIdacInit;
                    ptrIdacInit++;

                    ptrSnsTmp->idacComp[2u] = *ptrIdacInit;
                    ptrIdacInit++;
                #endif /* #if (0u != CapSense_1_MULTI_FREQ_SCAN_EN) */

                ptrSnsTmp++;
            }

            ptrFlashWdgt++; /* Move to next widget */
        }
    #endif /*(0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)*/

    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES))
        /* Initialize Sub-Conversion Number for each node of each CSX widget */
        ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;
        for (wdgtId = CapSense_1_TOTAL_WIDGETS; wdgtId-- > 0u;)
        {
            /* Check for widget sense method */
            if (CapSense_1_SENSE_METHOD_CSX_E == CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
            {
                /* Take the sub-convesion number of a CSX widget and initialize each node of this widget */
                subConvNumber = ((CapSense_1_RAM_WD_BASE_STRUCT *)(ptrFlashWdgt->ptr2WdgtRam))->resolution;
                ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
                for (snsId = CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWdgt); snsId-- > 0u;)
                {
                    ptrSnsTmp->subConvNum = subConvNumber;
                    ptrSnsTmp++;
                }
            }
            /* Move to the next widget */
            ptrFlashWdgt++;
        }
    #endif /* ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
               (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)) */

    #if (0u != CapSense_1_ADC_EN)
        CapSense_1_AdcDsInitialize();
    #endif /* (0u != CapSense_1_ADC_EN) */
}


#if (0u != CapSense_1_ADC_EN)
    /*******************************************************************************
    * Function Name: CapSense_1_AdcDsInitialize
    ****************************************************************************//**
    *
    * \brief
    *   Configures the initial Adc datastructure members.
    *
    *******************************************************************************/
    void CapSense_1_AdcDsInitialize(void)
    {
        CapSense_1_dsRam.adcResolution = CapSense_1_ADC_RESOLUTION;
        CapSense_1_dsRam.adcIdac = (uint8)(CapSense_1_ADC_IDAC_DEFAULT);
        CapSense_1_dsRam.adcActiveCh = CapSense_1_AdcNO_CHANNEL;
    }
#endif /* (0u != CapSense_1_ADC_EN) */


