NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
/*******************************************************************************
* Function Name: CapSense_1_IsSensorActive
****************************************************************************//**
*
* \brief
*  Reports if the specified sensor in the widget detects a touch.
*
* \details
*  This function reports if the specified sensor in the widget has detected a
*  touch or not by extracting information from the wdgtStatus registers
*  (CapSense_1_WDGT_STATUS<X>_VALUE). This function does not process the
*  widget or sensor but extracts processed results from the \ref group_structures.
*
*  For proximity sensors, this function returns the proximity detection status. To
*  get the finger touch status of proximity sensors, use the
*  CapSense_1_IsProximitySensorActive() function.
*
* \param widgetId
*  Specifies the ID number of the widget.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.

* \param sensorId
*  Specifies the ID number of the sensor within the widget to get its touch
*  detection status.
*  A macro for the sensor ID within the specified widget can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_SNS<SensorNumber>_ID.
*
* \return
*  Returns the touch detection status of the specified sensor / widget:
*    - Zero if no touch is detected in the specified sensor / widget or a wrong
*      widget ID / sensor ID is specified.
*    - Non-zero if the specified sensor is active i.e. touch is detected. If the
*      specific sensor belongs to a proximity widget, the proximity detection
*      status is returned.
*
*******************************************************************************/
uint32 CapSense_1_IsSensorActive(uint32 widgetId, uint32 sensorId)
{
    uint32 result = 0Lu;

    if ((widgetId < CapSense_1_TOTAL_WIDGETS) &&
        (sensorId < CapSense_1_GET_SENSOR_COUNT(widgetId)))
    {
        #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
            if (CapSense_1_WD_PROXIMITY_E ==
                (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[widgetId].wdgtType)
            {
                sensorId = CapSense_1_PROX_STS_OFFSET(sensorId);
            }
        #endif /* (CapSense_1_ENABLE != CapSense_1_PROXIMITY_WIDGET_EN) */
        result = CapSense_1_dsRam.snsStatus[widgetId] & (1Lu << sensorId);
    }

    return result;
}

#if (0u != CapSense_1_MATRIX_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_IsMatrixButtonsActive
****************************************************************************//**
*
* \brief
*  Reports the status of the specified matrix button widget.
*
* \details
*  This function reports if the specified matrix widget has detected a touch or
*  not by extracting information from the wdgtStatus registers
*  (CapSense_1_WDGT_STATUS<X>_VALUE for the CSD widgets and
*  CapSense_1_SNS_STATUS<WidgetId>_VALUE for CSX widget). In addition, the
*  function provides details of the active sensor including active rows/columns
*  for the CSD widgets. This function is used only with the matrix button
*  widgets. This function does not process the widget but extracts
*  processed results from the \ref group_structures.
*
* \param widgetId
*  Specifies the ID number of the matrix button widget to check the status of its
*  sensors.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header file
*  defined as CapSense_1_<WidgetName>_WDGT_ID
*
* \return
*  Returns the touch detection status of the sensors in the specified matrix
*  buttons widget. Zero indicates that no touch is detected in the specified
*  widget or a wrong widgetId is specified.
*    1. For the matrix buttons widgets with the CSD sensing mode:
*      - Bit [31] if set, indicates that one or more sensors in the widget
*        detected a touch.
*      - Bits [30..24] are reserved
*      - Bits [23..16] indicate the logical sensor number of the sensor that
*        detected a touch. If more than one sensor detected a touch for the CSD
*        widget, no status is reported because more than one touch is invalid for the
*        CSD matrix buttons widgets.
*      - Bits [15..8] indicate the active row number.
*      - Bits [7..0] indicate the active column number.
*    2. For the matrix buttons widgets with the CSX widgets, each bit (31..0)
*      corresponds to the TX/RX intersection.
*
*******************************************************************************/
uint32 CapSense_1_IsMatrixButtonsActive(uint32 widgetId)
{
    uint32 result = 0Lu;
    cy_status state = CY_RET_SUCCESS;
    CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt = 0u;

    #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
        CapSense_1_RAM_WD_CSD_MATRIX_STRUCT *wdCsdMatrix;
    #endif

    if (widgetId >= CapSense_1_TOTAL_WIDGETS)
    {
        state = CY_RET_BAD_PARAM;
    }
    else
    {
        ptrFlashWdgt = &CapSense_1_dsFlash.wdgtArray[widgetId];

        if ((CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType != CapSense_1_WD_MATRIX_BUTTON_E)
        {
            state = CY_RET_BAD_PARAM;
        }
        else if (0u == CapSense_1_GET_WIDGET_ACTIVE_STATUS(widgetId))
        {
            state = CY_RET_BAD_PARAM;
        }
        else
        {
            /* input parameters are OK */
        }
    }

    if (CY_RET_SUCCESS == state)
    {
        switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
        {
        #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
            case CapSense_1_SENSE_METHOD_CSD_E:
                wdCsdMatrix = ptrFlashWdgt->ptr2WdgtRam;

                result = CapSense_1_MATRIX_BUTTONS_TOUCHED |
                         ((uint32)wdCsdMatrix->posSnsId << 16u)  |
                         ((uint32)wdCsdMatrix->posRow   << 8u)   |
                         (uint32)wdCsdMatrix->posCol;
                break;
        #endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */

        #if (0u != CapSense_1_CSX_MATRIX_WIDGET_EN)
            case CapSense_1_SENSE_METHOD_CSX_E:
                result = CapSense_1_dsRam.snsStatus[widgetId];
                break;
        #endif /* #if (0u != CapSense_1_CSX_MATRIX_WIDGET_EN) */

        default:
            CY_ASSERT(0 != 0);
            break;
        }
    }

    return result;
}
#endif /* #if (0u != CapSense_1_MATRIX_WIDGET_EN) */

#if (0u != CapSense_1_PROXIMITY_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_IsProximitySensorActive
****************************************************************************//**
*
* \brief
*  Reports the finger detection status of the specified proximity widget/sensor.
*
* \details
*  This function reports if the specified proximity sensor has detected a touch
*  or not by extracting information from the wdgtStatus registers
*  (CapSense_1_SNS_STATUS<WidgetId>_VALUE). This function is used
*  only with proximity sensor widgets. This function does not process the
*  widget but extracts processed results from the \ref group_structures.
*
* \param widgetId
*  Specifies the ID number of the proximity widget.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID
*
* \param proxId
*  Specifies the ID number of the proximity sensor within the proximity widget to
*  get its touch detection status.
*  A macro for the proximity ID within a specified widget can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_SNS<SensorNumber>_ID
*
* \return
*  Returns the status of the specified sensor of the proximity widget. Zero
*  indicates that no touch is detected in the specified sensor / widget or a
*  wrong widgetId / proxId is specified.
*    - Bits [31..2] are reserved.
*    - Bit [1] indicates that a touch is detected.
*    - Bit [0] indicates that a proximity is detected.
*
*******************************************************************************/
uint32 CapSense_1_IsProximitySensorActive(uint32 widgetId, uint32 proxId)
{
    uint32 result = 0Lu;

    if ((widgetId < CapSense_1_TOTAL_WIDGETS) && (proxId < CapSense_1_GET_SENSOR_COUNT(widgetId)) &&
        (CapSense_1_WD_PROXIMITY_E ==
            (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[widgetId].wdgtType))
    {
        result = CapSense_1_dsRam.snsStatus[widgetId];
        result >>= CapSense_1_PROX_STS_OFFSET(proxId);
        result &=  CapSense_1_PROX_STS_MASK;
    }

    return result;
}
#endif /* #if (0u != CapSense_1_PROXIMITY_WIDGET_EN) */


#if (0u != CapSense_1_SLIDER_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_GetCentroidPos
****************************************************************************//**
*
* \brief
*  Reports the centroid position for the specified slider widget.
*
* \details
*  This function reports the centroid value of a specified radial or linear
*  slider widget by extracting information from the wdgtStatus registers
*  (CapSense_1_<WidgetName>_POSITION<X>_VALUE). This function is
*  used only with radial or linear slider widgets. This function does not
*  process the widget but extracts processed results from the \ref group_structures.
*
* \param widgetId
*  Specifies the ID number of a slider widget to get the centroid of the
*  detected touch.
*  A macro for the widget ID can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_WDGT_ID
*
* \return
*  Returns the centroid position of a specified slider widget:
*    - The centroid position if a touch is detected.
*    - CapSense_1_SLIDER_NO_TOUCH - No touch is detected or a wrong
*      widgetId is specified.
*
*******************************************************************************/
uint32 CapSense_1_GetCentroidPos(uint32 widgetId)
{
    uint32 result = CapSense_1_SLIDER_NO_TOUCH;
    CapSense_1_RAM_WD_SLIDER_STRUCT *wdSlider;

    if ((widgetId < CapSense_1_TOTAL_WIDGETS) &&
        ((CapSense_1_WD_LINEAR_SLIDER_E ==
            (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[widgetId].wdgtType) ||
         (CapSense_1_WD_RADIAL_SLIDER_E ==
            (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[widgetId].wdgtType)))
    {
        wdSlider = CapSense_1_dsFlash.wdgtArray[widgetId].ptr2WdgtRam;
        result = (uint32)wdSlider->position[0u];
    }

    return result;
}
#endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */


