NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
#if (0u != CapSense_1_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_GetXYCoordinates
****************************************************************************//**
*
* \brief
*  Reports the X/Y position detected for the specified touchpad widget.
*
* \details
*  This function reports a touch position (X and Y coordinates) value of a
*  specified touchpad widget by extracting information from the wdgtStatus
*  registers (CapSense_1_<WidgetName>_POS_Y_VALUE). This function should
*  be used only with the touchpad widgets. This function does not process the
*  widget but extracts processed results from the \ref group_structures.
*
* \param widgetId
*  Specifies the ID number of a touchpad widget to get the X/Y position of a
*  detected touch.
*  A macro for the widget ID can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_WDGT_ID.
*
* \return
*  Returns the touch position of a specified touchpad widget:
*    1. If a touch is detected:
*      - Bits [31..16] indicate the Y coordinate.
*      - Bits [15..0] indicate the X coordinate.
*    2. If no touch is detected or a wrong widgetId is specified:
*      - CapSense_1_TOUCHPAD_NO_TOUCH.
*
*******************************************************************************/
uint32 CapSense_1_GetXYCoordinates(uint32 widgetId)
{
    CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt = NULL;

    #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
        CapSense_1_RAM_WD_CSD_TOUCHPAD_STRUCT *wdCsdTouchpad;
    #endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

    #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
        CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *wdCsxTouchpad;
    #endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

    cy_status state = CY_RET_SUCCESS;
    uint32 result = CapSense_1_TOUCHPAD_NO_TOUCH;

    if (widgetId >= CapSense_1_TOTAL_WIDGETS)
    {
        state = CY_RET_BAD_PARAM;
    }
    else
    {
        ptrFlashWdgt = &CapSense_1_dsFlash.wdgtArray[widgetId];

        if ((CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType != CapSense_1_WD_TOUCHPAD_E)
        {
            state = CY_RET_BAD_PARAM;
        }
    }

    if (CY_RET_SUCCESS == state)
    {
        switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
        {
        #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
            case CapSense_1_SENSE_METHOD_CSD_E:
                wdCsdTouchpad = ptrFlashWdgt->ptr2WdgtRam;
                #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
                    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
                        if (0 != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_5X5_MASK))
                        {
                    #endif
                        result = ((uint32)wdCsdTouchpad->position.pos[0u].x) |
                                 ((uint32)wdCsdTouchpad->position.pos[0u].y << 16u);
                    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
                        }
                    #endif
                #endif

                #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
                    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
                        if (0 != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_3X3_MASK))
                        {
                    #endif
                        result = ((uint32)wdCsdTouchpad->posX) |
                                 ((uint32)wdCsdTouchpad->posY << 16u);
                    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
                        }
                    #endif
                #endif

                break;
        #endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

        #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
            case CapSense_1_SENSE_METHOD_CSX_E:
                wdCsxTouchpad = ptrFlashWdgt->ptr2WdgtRam;

                result = ((uint32)wdCsxTouchpad->touch[0u].x) |
                         ((uint32)wdCsxTouchpad->touch[0u].y << 16u);
                break;
        #endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

        default:
            CY_ASSERT(0 != 0);
            break;
        }
    }

    return result;
}
#endif /* #if (0u != CapSense_1_TOUCHPAD_WIDGET_EN) */


/* [] END OF FILE */
